
  **Terraform apply** (Okta preview) ran in [5 seconds](https://github.com/evanyeung-clear/terraform-ci/actions/runs/23126022238).
  ```
  terraform-ci apply -no-color -input=false -auto-approve -target=okta_user.service-account-1
  ```

  <details>
  <summary>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
</summary>

  ```
  [INFO] Starting Terraform preprocessing in terraform environment...
[INFO] Cleaning up existing temporary files...
[INFO] Consolidating .tf files from subdirectories into _consolidated.tf...
[INFO] Consolidated 1 files into _consolidated.tf
[INFO] Source map written to _consolidated_source_map.json
[INFO] Running terraform with arguments: apply -no-color -input=false -auto-approve -target=okta_user.service-account-1
[INFO] Using terraform executable: /usr/local/bin/terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # okta_user.service-account-1 will be created
  + resource "okta_user" "service-account-1" {
      + custom_profile_attributes = (known after apply)
      + email                     = "service1@example.com"
      + expire_password_on_create = false
      + first_name                = "Service"
      + id                        = (known after apply)
      + last_name                 = "Account 1"
      + login                     = "service1@example.com"
      + raw_status                = (known after apply)
      + skip_roles                = false
      + status                    = "ACTIVE"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
okta_user.service-account-1: Creating...
okta_user.service-account-1: Creation complete after 1s [id=00u1112jzalYcq0eH698]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[INFO] Cleaning up temporary file...
[INFO] Removing: _consolidated.tf

  ```
  </details>

  ---
  > 📌 Reminder to validate the configuration was applied correctly, then **merge this PR** to release the deployment lock.
  